msf-teambuilder-backend/app/models/character.rb

UPDATE "characters" SET "position" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["position", 1], ["updated_at", "2020-06-03 20:56:13.895757"], ["id", 33]]
---
  def move_up
    self.position = self.position - 1
    self.save

UPDATE "characters" SET "position" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["position", 5], ["updated_at", "2020-06-03 21:41:52.898390"], ["id", 14]]
---
  def move_down
    self.position = self.position + 1
    self.save