msf-teambuilder-backend/app/controllers/characters_controller.rb

    def create
        character = Character.new(character_params)
        character.position = (character.team.characters.length + 1)
        if character.save
---
SELECT "characters".* FROM "characters" WHERE "characters"."team_id" = $1  [["team_id", 9]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "characters" ("name", "power", "team_id", "created_at", "updated_at", "position") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Human Torch"], ["power", 124895], ["team_id", 9], ["created_at", "2020-06-05 23:37:25.633979"], ["updated_at", "2020-06-05 23:37:25.633979"], ["position", 1]]

    def destroy
        character = Character.find_by(id: params[:id])
        team = character.team
        character.destroy

        team.characters.each do |other_team_char|
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 26]]
SELECT "characters".* FROM "characters" WHERE "characters"."team_id" = $1  [["team_id", 11]]

    def update
        character = Character.find_by(id: params[:id])
        team = character.team

        if params[:move] == "up"
            displaced_char = team.characters.find_by(position: (character.position - 1))
            displaced_char.move_down
            character.move_up
        elsif params[:move] == "down"
            displaced_char = team.characters.find_by(position: (character.position + 1))
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."team_id" = $1 AND "characters"."position" = $2 LIMIT $3  [["team_id", 11], ["position", 1], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."team_id" = $1 AND "characters"."position" = $2 LIMIT $3  [["team_id", 1], ["position", 2], ["LIMIT", 1]]