msf-teambuilder-backend/app/controllers/teams_controller.rb

    def index
        teams = Team.all
---
SELECT "teams".* FROM "teams"

    def create
        team = Team.new(team_params)
        if team.save
---
INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Defenders"], ["created_at", "2020-06-03 00:26:38.290026"], ["updated_at", "2020-06-03 00:26:38.290026"]]

    def destroy
        team = Team.find_by(id: params[:id])
        team.destroy
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 5]]